[
  {
    "title": "How I Got My ILOE Claim Approved in the UAE: A Real Expat Story",
    "link": "https://randoms.top/pages/How I Got My ILOE Claim Approved in the UAE A Real Expat Story.html",
    "image": "https://i.postimg.cc/VLBg8Khm/image1-large.jpg",
    "snippet": "After spending more than 15 years working in the UAE, and 7 more as a..",
    "tag": "Story"
  },
  {
    "title": "Beware of This Person: A Warning for the Community",
    "link": "https://randoms.top/pages/Beware of This Person A Warning for the Community.html",
    "image": "https://i.postimg.cc/0yDktJX6/febfa0d7-060d-4b9f-9260-e2c88e0e38e4.png",
    "snippet": "This person claimed to know someone in the CID who could “help” with travel bans. It didn’t take long before it became clear that this was a..",
    "tag": "Story"
  },
  {
    "title": "When It Hurts More: Rudeness from Your Own Community",
    "link": "https://randoms.top/pages/When It Hurts More Rudeness from Your Own Community.html",
    "image": "https://i.postimg.cc/MTvKm3Cw/643847b6-c4e2-464e-8f15-23d50b131b53.png",
    "snippet": "Today I went to a bank in Sharjah, and the staff member (also Pakistani, I believe) looked at me with a disgusted expression when..",
    "tag": "Story"
  },
  {
    "title": "I’m Pregnant — And He Blew Smoke in My Face",
    "link": "https://randoms.top/pages/Im Pregnant — And He Blew Smoke in My Face.html",
    "image": "https://i.postimg.cc/jd4vyqWh/image1-large.jpg",
    "snippet": "Then, out of nowhere — a stranger lights his cigarette, looks straight at me, and deliberately..",
    "tag": "Story"
  },
  {
    "title": "From Afar, Perfect — But Up Close?",
    "link": "https://randoms.top/pages/From Afar, Perfect — But Up Close.html",
    "image": "https://i.postimg.cc/cCtsn51p/image1-large.jpg",
    "snippet": "Always sharply dressed. Confident. Handsome. From a distance, he’s the kind of..",
    "tag": "Story"
  },
  {
    "title": "Fire, Theft, and Silence: A Harsh Lesson in Al Rigga",
    "link": "https://randoms.top/pages/Fire, Theft, and Silence A Harsh Lesson in Al Rigga.html",
    "image": "https://i.postimg.cc/7hf4yTrq/image0-large.jpg",
    "snippet": "He's living in a partitioned building, like many others trying to survive in Dubai while..",
    "tag": "Story"
  },
  {
    "title": "Anything, Sir: A Tale of Two Job Markets in the UAE",
    "link": "https://randoms.top/pages/Anything, Sir A Tale of Two Job Markets in the UAE.html",
    "image": "https://i.postimg.cc/MHQzkSqH/image1-large.jpg",
    "snippet": "I’ve been hiring for years. From Dubai to Abu Dhabi, I’ve met candidates from all corners of the world. But there’s one question—",
    "tag": "Story"
  },
  {
    "title": "Do Them Right: A Message to Every Manager in the UAE",
    "link": "https://randoms.top/pages/Do Them Right A Message to Every Manager in the UAE.html",
    "image": "https://i.postimg.cc/Jn2BcZ1X/image0-large.jpg",
    "snippet": "Even if you don’t personally like someone. Even if they’re quiet. Even if they don’t flatter you or laugh at your jokes.",
    "tag": "Story"
  }
]
